Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.0.17/CA80/atdf/PIC32CZ2051CA80176.atdf
        <register name="TSTIDOUT" offset="0x164" rw="RW" size="4" initval="0x00000000" caption="Test Degug2 Register">
          <bitfield name="TSTCORID" caption="Core Digital Test Out Read ID" mask="0x1"/>
        </register>
        <register name="DBGCTRL" offset="0x168" rw="RW" size="4" initval="0x00000000" caption="Debug Control Register">
          <bitfield name="DBGRUN" caption="Debug Running State" mask="0x1"/>
        </register>
      </register-group>
      <value-group caption="ADC Resolution bits" name="CORCTRL__SELRES">
        <value name="6_BITS" caption="6 bits" value="0x0"/>
        <value name="8_BITS" caption="8 bits" value="0x1"/>
        <value name="10_BITS" caption="10 bits" value="0x2"/>
        <value name="12_BITS" caption="12 bits (default)" value="0x3"/>
      </value-group>
      <value-group caption="Oversampling Filter Ratio bits" name="FLTCTRL__OVRSAM">
        <value name="4_SAMPLES" caption="(If FMODE is 0) 4 samples (shift sum 1 bit to right, output data is 13-bits) / (If FMODE is 1) 2 samples to be averaged" value="0x0"/>
        <value name="16_SAMPLES" caption="(If FMODE is 0) 16 samples (shift sum 2 bits to right, output data is 14-bits) / (If FMODE is 1) 4 samples to be averaged" value="0x1"/>
        <value name="64_SAMPLES" caption="(If FMODE is 0) 64 samples (shift sum 3 bits to right, output data is 15-bits) / (If FMODE is 1) 8 samples to be averaged" value="0x2"/>
        <value name="256_SAMPLES" caption="(If FMODE is 0) 256 samples (shift sum 4 bits to right, output data is 16-bits) / (If FMODE is 1) 16 samples to be averaged" value="0x3"/>
        <value name="2_SAMPLES" caption="(If FMODE is 0) 2 samples (shift sum 0 bits to right, output data is 12.1 format) / (If FMODE is 1) 32 samples to be averaged" value="0x4"/>
        <value name="8_SAMPLES" caption="(If FMODE is 0) 8 samples (shift sum 1 bit to right, output data is 13.1 format) / (If FMODE is 1) 64 samples to be averaged" value="0x5"/>
        <value name="32_SAMPLES" caption="(If FMODE is 0) 32 samples (shift sum 2 bits to right, output data is 14.1 format) / (If FMODE is 1) 128 samples to be averaged" value="0x6"/>
        <value name="128_SAMPLES" caption="(If FMODE is 0) 128 samples (shift sum 3 bits to right, output data is 15.1 format) / (If FMODE is 1) 256 samples to be averaged" value="0x7"/>
      </value-group>
      <value-group caption="Trigger Source for Conversion" name="CHNCFG4_CHNCFG5__TRGSRC">
        <value name="NO_TRIGGER" caption="No Trigger (NOP)" value="0x0"/>
        <value name="GLOBAL_SOFTWARE_TRIGGER" caption="Global Software Trigger" value="0x1"/>
        <value name="GLOBAL_LEVEL_TRIGGER" caption="Global Level Software Trigger" value="0x2"/>
        <value name="SCAN_TRIGGER" caption="SCANTRG - Scan Trigger" value="0x3"/>
        <value name="SYNC_TRIGGER" caption="STRIG Synchronous Trigger" value="0x4"/>
        <value name="EVENT_USER0" caption="ADC Trigger Event User 0" value="0x5"/>
        <value name="EVENT_USER1" caption="ADC Trigger Event User 1" value="0x6"/>
        <value name="EVENT_USER2" caption="ADC Trigger Event User 2" value="0x7"/>
        <value name="EVENT_USER3" caption="ADC Trigger Event User 3" value="0x8"/>
        <value name="EVENT_USER4" caption="ADC Trigger Event User 4" value="0x9"/>
        <value name="EVENT_USER5" caption="ADC Trigger Event User 5" value="0xA"/>
        <value name="EVENT_USER6" caption="ADC Trigger Event User 6" value="0xB"/>
        <value name="EVENT_USER7" caption="ADC Trigger Event User 7" value="0xC"/>
        <value name="EVENT_USER8" caption="ADC Trigger Event User 8" value="0xD"/>
        <value name="EVENT_USER9" caption="ADC Trigger Event User 9" value="0xE"/>
        <value name="EVENT_USER10" caption="ADC Trigger Event User 10" value="0xF"/>
      </value-group>
      <value-group caption="SCAN Trigger Source Selection" name="CORCTRL__STRGSRC">
        <value name="NO_TRIGGER" caption="No Trigger (NOP)" value="0x0"/>
        <value name="GLOBAL_SOFTWARE_TRIGGER" caption="Global Software Trigger" value="0x1"/>
        <value name="GLOBAL_LEVEL_TRIGGER" caption="Global Level Software Trigger" value="0x2"/>
        <value name="SYNC_TRIGGER" caption="STRIG Synchronous Trigger" value="0x4"/>
        <value name="EVENT_USER0" caption="ADC Trigger Event User 0" value="0x5"/>
        <value name="EVENT_USER1" caption="ADC Trigger Event User 1" value="0x6"/>
        <value name="EVENT_USER2" caption="ADC Trigger Event User 2" value="0x7"/>
        <value name="EVENT_USER3" caption="ADC Trigger Event User 3" value="0x8"/>
        <value name="EVENT_USER4" caption="ADC Trigger Event User 4" value="0x9"/>
        <value name="EVENT_USER5" caption="ADC Trigger Event User 5" value="0xA"/>
        <value name="EVENT_USER6" caption="ADC Trigger Event User 6" value="0xB"/>
        <value name="EVENT_USER7" caption="ADC Trigger Event User 7" value="0xC"/>
        <value name="EVENT_USER8" caption="ADC Trigger Event User 8" value="0xD"/>
        <value name="EVENT_USER9" caption="ADC Trigger Event User 9" value="0xE"/>
        <value name="EVENT_USER10" caption="ADC Trigger Event User 10" value="0xF"/>
      </value-group>
      <value-group caption="Voltage Reference Input Selection bits" name="CTRLD__VREFSEL">
        <value name="AVDD_AVSS" caption="AVDD and AVSS" value="0x0"/>
        <value name="EXTERNAL_VREFH_AVSS" caption="External VREFH and AVSS" value="0x1"/>
      </value-group>
      <value-group caption="ADC DMA PFFRDY Trigger Selection bits" name="PFFCTRL__PFFRDYDMA">
        <value name="CTLINTFLAG_PFFHFUL" caption="Selects CTLINTFLAG.PFFHFUL for the ADC DMA PFFRDY trigger signal to the DMAC" value="0x0"/>
        <value name="CTLINTFLAG_PFFRDY" caption="Selects CTLINTFLAG.PFFRDY for the ADC DMA PFFRDY trigger signal to the DMAC" value="0x1"/>
      </value-group>
      <value-group caption="ADC SAR Cores Interleaving Selection bits" name="CTRLC__COREINTERLEAVED">
        <value name="INTERLEAVING_OFF" caption="Interleaving Off" value="0x0"/>
        <value name="INTERLEAVING_CORES_0_1" caption="Interleaving Cores 0 and 1" value="0x4"/>
        <value name="INTERLEAVING_CORES_1_2" caption="Interleaving Cores 1 and 2" value="0x1"/>
        <value name="INTERLEAVING_CORES_0_1_2" caption="Interleaving Cores 0, 1 and 2" value="0x5"/>
        <value name="INTERLEAVING_CORES_1_2_3" caption="Interleaving Cores 1, 2 and 3" value="0x2"/>
        <value name="INTERLEAVING_CORES_0_1_2_3" caption="Interleaving Cores 0, 1, 2 and 3" value="0x3"/>
      </value-group>
    </module>
    <module name="BSDAP" id="04702" name2="jtag_bs_dap_sib_v1" version="1a0" caption="Boundary Scan DAP System Integration Block">
    </module>
    <module name="CAN" id="03723" name2="can_fd_u2003_v4" version="4a0" caption="Control Area Network">
      <register-group name="CAN" caption="Control Area Network">
        <register name="CREL" offset="0x0" rw="R" size="4" initval="0x32300000" caption="Core Release">
          <bitfield name="SUBSTEP" caption="Sub-step of Core Release" mask="0xF00000"/>
          <bitfield name="STEP" caption="Step of Core Release" mask="0xF000000"/>
          <bitfield name="REL" caption="Core Release" mask="0xF0000000"/>
        </register>
        <register name="ENDN" offset="0x4" rw="R" size="4" initval="0x87654321" caption="Endian">
          <bitfield name="ETV" caption="Endianness Test Value" mask="0xFFFFFFFF"/>
        </register>
