Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.0.17/CA80/atdf/PIC32CZ2051CA80176.atdf
        <register name="FPDSCR" offset="0xC" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Floating-Point Default Status Control Register">
          <bitfield name="RMODE" caption="Default value for FPSCR.RMODE" mask="0xC00000" values="FPDSCR__RMODE"/>
          <bitfield name="FZ" caption="Default value for FPSCR.FZ" mask="0x1000000"/>
          <bitfield name="DN" caption="Default value for FPSCR.DN" mask="0x2000000"/>
          <bitfield name="AHP" caption="Default value for FPSCR.AHP" mask="0x4000000"/>
        </register>
        <register name="MVFR0" offset="0x10" rw="R" size="4" access-size="4" initval="0x10110021" caption="Media and FP Feature Register 0">
          <bitfield name="A_SIMD_registers" caption="" mask="0xF"/>
          <bitfield name="Single_precision" caption="" mask="0xF0"/>
          <bitfield name="Double_precision" caption="" mask="0xF00"/>
          <bitfield name="FP_excep_trapping" caption="" mask="0xF000"/>
          <bitfield name="Divide" caption="" mask="0xF0000"/>
          <bitfield name="Square_root" caption="" mask="0xF00000"/>
          <bitfield name="Short_vectors" caption="" mask="0xF000000"/>
          <bitfield name="FP_rounding_modes" caption="" mask="0xF0000000"/>
        </register>
        <register name="MVFR1" offset="0x14" rw="R" size="4" access-size="4" initval="0x10000011" caption="Media and FP Feature Register 1">
          <bitfield name="FtZ_mode" caption="" mask="0xF"/>
          <bitfield name="D_NaN_mode" caption="" mask="0xF0"/>
          <bitfield name="FP_HPFP" caption="" mask="0xF000000"/>
          <bitfield name="FP_fused_MAC" caption="" mask="0xF0000000"/>
        </register>
        <register name="MVFR2" offset="0x18" rw="R" size="4" access-size="4" initval="0x00000040" caption="Media and FP Feature Register 2">
        </register>
      </register-group>
      <value-group name="FPDSCR__RMODE">
        <value name="RN" caption="Round to Nearest" value="0x0"/>
        <value name="RP" caption="Round towards Positive Infinity" value="0x1"/>
        <value name="RM" caption="Round towards Negative Infinity" value="0x2"/>
        <value name="RZ" caption="Round towards Zero" value="0x3"/>
      </value-group>
    </module>
    <module name="FREQM" id="03707" name2="clk_freqm_u2257_v3" version="3a0" caption="Frequency Meter">
      <register-group name="FREQM" caption="Frequency Meter">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x80" caption="Control A Register">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="FREERUN" caption="Free Running Mode" mask="0x4"/>
          <bitfield name="RUNSTDBY" caption="Run In Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
        </register>
        <register name="CTRLB" offset="0x1" rw="W" size="1" initval="0x00" caption="Control B Register">
          <bitfield name="START" caption="Start Measurement" mask="0x1"/>
        </register>
        <register name="CFGA" offset="0x2" rw="RW" size="2" initval="0x0000" caption="Config A Register">
          <bitfield name="REFNUM" caption="Number of Reference Clock Cycles" mask="0xFF"/>
          <bitfield name="MSRSEL" caption="Measurement Clock Selection" mask="0x700" values="CFGA__MSRSEL"/>
          <bitfield name="DIVREF" caption="Divide Reference Clock" mask="0x8000" values="CFGA__DIVREF"/>
        </register>
        <register name="CTRLC" offset="0x4" rw="RW" size="1" initval="0x00" caption="Control C Register">
          <bitfield name="WINMODE" caption="Window Monitor Mode" mask="0x7" values="CTRLC__WINMODE"/>
        </register>
        <register name="EVCTRL" offset="0x6" rw="RW" size="1" initval="0x00" caption="Event Control Register">
          <bitfield name="STARTEI" caption="Start Measurement Event Input Enable" mask="0x1"/>
          <bitfield name="STARTINV" caption="Start Measurement Event Invert Enable" mask="0x2"/>
          <bitfield name="DONEEO" caption="Measurement Done Event Out" mask="0x10"/>
          <bitfield name="WINMONEO" caption="Window Monitor Event Out" mask="0x20"/>
        </register>
        <register name="INTENCLR" offset="0x8" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear Register">
          <bitfield name="DONE" caption="Measurement Done Interrupt Disable" mask="0x1"/>
          <bitfield name="WINMON" caption="Window Monitor Interrupt Disable" mask="0x2"/>
        </register>
        <register name="INTENSET" offset="0x9" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set Register">
          <bitfield name="DONE" caption="Measurement Done Interrupt Enable" mask="0x1"/>
          <bitfield name="WINMON" caption="Window Monitor Interrupt Enable" mask="0x2"/>
        </register>
        <register name="INTFLAG" offset="0xA" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Register">
          <bitfield name="DONE" caption="Measurement Done" mask="0x1"/>
          <bitfield name="WINMON" caption="Window Monitor" mask="0x2"/>
        </register>
        <register name="STATUS" offset="0xB" rw="RW" size="1" initval="0x00" caption="Status Register">
          <bitfield name="BUSY" caption="FREQM Status" mask="0x1"/>
          <bitfield name="OVF" caption="Sticky Count Value Overflow" mask="0x2"/>
        </register>
        <register name="SYNCBUSY" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy Register">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
        <register name="VALUE" offset="0x10" rw="R" size="4" initval="0x00000000" caption="Count Value Register">
          <bitfield name="VALUE" caption="Measurement Value" mask="0xFFFFFF"/>
        </register>
        <register name="WINLT" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="Window Monitor Lower Threshold">
          <bitfield name="WINLT" caption="Window Lower Threshold" mask="0xFFFFFF"/>
        </register>
        <register name="WINUT" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="Window Monitor Upper Threshold">
          <bitfield name="WINUT" caption="Window Upper Threshold" mask="0xFFFFFF"/>
        </register>
      </register-group>
      <value-group name="CFGA__MSRSEL">
        <value name="GCLK" caption="GCLK Input Clock" value="0x0"/>
        <value name="CPU" caption="CPU Input Clock" value="0x1"/>
      </value-group>
