Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.0.17/CA80/atdf/PIC32CZ2051CA80176.atdf
        <register name="STATUS" offset="0x30" rw="RW" access="RWSYNC" size="4" initval="0x00000001" caption="Status">
          <bitfield name="STOP" caption="Stop" mask="0x1"/>
          <bitfield name="IDX" caption="Ramp" mask="0x2"/>
          <bitfield name="UFS" caption="Non-recoverable Update Fault State" mask="0x4"/>
          <bitfield name="DFS" caption="Non-Recoverable Debug Fault State" mask="0x8"/>
          <bitfield name="SLAVE" caption="Slave" mask="0x10"/>
          <bitfield name="PATTBUFV" caption="Pattern Buffer Valid" mask="0x20"/>
          <bitfield name="PERBUFV" caption="Period Buffer Valid" mask="0x80"/>
          <bitfield name="FAULTAIN" caption="Recoverable Fault A Input" mask="0x100"/>
          <bitfield name="FAULTBIN" caption="Recoverable Fault B Input" mask="0x200"/>
          <bitfield name="FAULT0IN" caption="Non-Recoverable Fault0 Input" mask="0x400"/>
          <bitfield name="FAULT1IN" caption="Non-Recoverable Fault1 Input" mask="0x800"/>
          <bitfield name="FAULTA" caption="Recoverable Fault A State" mask="0x1000"/>
          <bitfield name="FAULTB" caption="Recoverable Fault B State" mask="0x2000"/>
          <bitfield name="FAULT0" caption="Non-Recoverable Fault 0 State" mask="0x4000"/>
          <bitfield name="FAULT1" caption="Non-Recoverable Fault 1 State" mask="0x8000"/>
          <bitfield name="CCBUFV0" caption="Compare Channel 0 Buffer Valid" mask="0x10000"/>
          <bitfield name="CCBUFV1" caption="Compare Channel 1 Buffer Valid" mask="0x20000"/>
          <bitfield name="CCBUFV2" caption="Compare Channel 2 Buffer Valid" mask="0x40000"/>
          <bitfield name="CCBUFV3" caption="Compare Channel 3 Buffer Valid" mask="0x80000"/>
          <bitfield name="CCBUFV4" caption="Compare Channel 4 Buffer Valid" mask="0x100000"/>
          <bitfield name="CCBUFV5" caption="Compare Channel 5 Buffer Valid" mask="0x200000"/>
          <bitfield name="CCBUFV6" caption="Compare Channel 6 Buffer Valid" mask="0x400000"/>
          <bitfield name="CCBUFV7" caption="Compare Channel 7 Buffer Valid" mask="0x800000"/>
          <bitfield name="CMP0" caption="Compare Channel 0 Value" mask="0x1000000"/>
          <bitfield name="CMP1" caption="Compare Channel 1 Value" mask="0x2000000"/>
          <bitfield name="CMP2" caption="Compare Channel 2 Value" mask="0x4000000"/>
          <bitfield name="CMP3" caption="Compare Channel 3 Value" mask="0x8000000"/>
          <bitfield name="CMP4" caption="Compare Channel 4 Value" mask="0x10000000"/>
          <bitfield name="CMP5" caption="Compare Channel 5 Value" mask="0x20000000"/>
          <bitfield name="CMP6" caption="Compare Channel 6 Value" mask="0x40000000"/>
          <bitfield name="CMP7" caption="Compare Channel 7 Value" mask="0x80000000"/>
        </register>
        <register name="COUNT" offset="0x34" rw="RW" access="RWSYNC" size="4" initval="0x00000000" caption="Count">
          <mode name="DEFAULT" qualifier="TCC.CTRLA.RESOLUTION" value="0"/>
          <mode name="DITH4" qualifier="TCC.CTRLA.RESOLUTION" value="1"/>
          <mode name="DITH5" qualifier="TCC.CTRLA.RESOLUTION" value="2"/>
          <mode name="DITH6" qualifier="TCC.CTRLA.RESOLUTION" value="3"/>
          <bitfield modes="DITH6" name="COUNT" caption="Counter Value" mask="0xFFFFFFC0"/>
          <bitfield modes="DITH5" name="COUNT" caption="Counter Value" mask="0xFFFFFFE0"/>
          <bitfield modes="DITH4" name="COUNT" caption="Counter Value" mask="0xFFFFFFF0"/>
          <bitfield modes="DEFAULT" name="COUNT" caption="Counter Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="PATT" offset="0x38" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="Pattern">
          <bitfield name="PGE0" caption="Pattern Generator 0 Output Enable" mask="0x1"/>
          <bitfield name="PGE1" caption="Pattern Generator 1 Output Enable" mask="0x2"/>
          <bitfield name="PGE2" caption="Pattern Generator 2 Output Enable" mask="0x4"/>
          <bitfield name="PGE3" caption="Pattern Generator 3 Output Enable" mask="0x8"/>
          <bitfield name="PGE4" caption="Pattern Generator 4 Output Enable" mask="0x10"/>
          <bitfield name="PGE5" caption="Pattern Generator 5 Output Enable" mask="0x20"/>
          <bitfield name="PGE6" caption="Pattern Generator 6 Output Enable" mask="0x40"/>
          <bitfield name="PGE7" caption="Pattern Generator 7 Output Enable" mask="0x80"/>
          <bitfield name="PGV0" caption="Pattern Generator 0 Output Value" mask="0x100"/>
          <bitfield name="PGV1" caption="Pattern Generator 1 Output Value" mask="0x200"/>
          <bitfield name="PGV2" caption="Pattern Generator 2 Output Value" mask="0x400"/>
          <bitfield name="PGV3" caption="Pattern Generator 3 Output Value" mask="0x800"/>
          <bitfield name="PGV4" caption="Pattern Generator 4 Output Value" mask="0x1000"/>
          <bitfield name="PGV5" caption="Pattern Generator 5 Output Value" mask="0x2000"/>
          <bitfield name="PGV6" caption="Pattern Generator 6 Output Value" mask="0x4000"/>
          <bitfield name="PGV7" caption="Pattern Generator 7 Output Value" mask="0x8000"/>
        </register>
        <register name="WAVE" offset="0x3C" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="Waveform Control">
          <bitfield name="WAVEGEN" caption="Waveform Generation" mask="0x7" values="TCC_WAVE__WAVEGEN"/>
          <bitfield name="RAMP" caption="Ramp Mode" mask="0x30" values="WAVE__RAMP"/>
          <bitfield name="CIPEREN" caption="Circular period Enable" mask="0x80"/>
          <bitfield name="CICCEN0" caption="Circular Channel 0 Enable" mask="0x100"/>
          <bitfield name="CICCEN1" caption="Circular Channel 1 Enable" mask="0x200"/>
          <bitfield name="CICCEN2" caption="Circular Channel 2 Enable" mask="0x400"/>
          <bitfield name="CICCEN3" caption="Circular Channel 3 Enable" mask="0x800"/>
          <bitfield name="POL0" caption="Channel 0 Polarity" mask="0x10000"/>
          <bitfield name="POL1" caption="Channel 1 Polarity" mask="0x20000"/>
          <bitfield name="POL2" caption="Channel 2 Polarity" mask="0x40000"/>
          <bitfield name="POL3" caption="Channel 3 Polarity" mask="0x80000"/>
          <bitfield name="POL4" caption="Channel 4 Polarity" mask="0x100000"/>
          <bitfield name="POL5" caption="Channel 5 Polarity" mask="0x200000"/>
          <bitfield name="POL6" caption="Channel 6 Polarity" mask="0x400000"/>
          <bitfield name="POL7" caption="Channel 7 Polarity" mask="0x800000"/>
          <bitfield name="SWAP0" caption="Swap DTI Output Pair 0" mask="0x1000000"/>
          <bitfield name="SWAP1" caption="Swap DTI Output Pair 1" mask="0x2000000"/>
          <bitfield name="SWAP2" caption="Swap DTI Output Pair 2" mask="0x4000000"/>
          <bitfield name="SWAP3" caption="Swap DTI Output Pair 3" mask="0x8000000"/>
        </register>
        <register name="PER" offset="0x40" rw="RW" access="WSYNC" size="4" initval="0xFFFFFFFF" caption="Period">
          <mode name="DEFAULT" qualifier="TCC.CTRLA.RESOLUTION" value="0"/>
          <mode name="DITH4" qualifier="TCC.CTRLA.RESOLUTION" value="1"/>
          <mode name="DITH5" qualifier="TCC.CTRLA.RESOLUTION" value="2"/>
          <mode name="DITH6" qualifier="TCC.CTRLA.RESOLUTION" value="3"/>
          <bitfield modes="DITH4" name="DITHER" caption="Dithering Cycle Number" mask="0xF"/>
          <bitfield modes="DITH5" name="DITHER" caption="Dithering Cycle Number" mask="0x1F"/>
          <bitfield modes="DITH6" name="DITHER" caption="Dithering Cycle Number" mask="0x3F"/>
          <bitfield modes="DITH6" name="PER" caption="Period Value" mask="0xFFFFFFC0"/>
          <bitfield modes="DITH5" name="PER" caption="Period Value" mask="0xFFFFFFE0"/>
          <bitfield modes="DITH4" name="PER" caption="Period Value" mask="0xFFFFFFF0"/>
          <bitfield modes="DEFAULT" name="PER" caption="Period Value" mask="0xFFFFFFFF"/>
        </register>
