Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.0.17/CA80/atdf/PIC32CZ2051CA80176.atdf
      <value-group name="PHY00__RXPHSSEL">
        <value name="EARLIEST" caption="Earliest phase" value="0x0"/>
        <value name="LATEST" caption="Latest phase" value="0x7"/>
      </value-group>
    </module>
    <module name="WDT" id="03611" name2="wdt_u2251_v2" version="2b0" caption="Watchdog Timer">
      <register-group name="WDT" caption="Watchdog Timer">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="WEN" caption="Watchdog Timer Window Mode Enable" mask="0x4"/>
          <bitfield name="RUNSTDBY" caption="Run During Standby" mask="0x40"/>
          <bitfield name="ALWAYSON" caption="Always-On" mask="0x80"/>
        </register>
        <register name="CONFIG" offset="0x1" rw="RW" size="1" initval="0xBB" caption="Configuration">
          <bitfield name="PER" caption="Time-Out Period" mask="0xF" values="CONFIG__PER"/>
          <bitfield name="WINDOW" caption="Window Mode Time-Out Period" mask="0xF0" values="CONFIG__WINDOW"/>
        </register>
        <register name="EWCTRL" offset="0x2" rw="RW" size="1" initval="0x0B" caption="Early Warning Interrupt Control">
          <bitfield name="EWOFFSET" caption="Early Warning Interrupt Time Offset" mask="0xF" values="EWCTRL__EWOFFSET"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="EW" caption="Early Warning Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x5" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="EW" caption="Early Warning Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0x6" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="EW" caption="Early Warning" mask="0x1"/>
        </register>
        <register name="SYNCBUSY" offset="0x8" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="ENABLE" caption="Enable Synchronization Busy" mask="0x2"/>
          <bitfield name="WEN" caption="Window Enable Synchronization Busy" mask="0x4"/>
          <bitfield name="RUNSTDBY" caption="Run During Standby Synchronization Busy" mask="0x8"/>
          <bitfield name="ALWAYSON" caption="Always-On Synchronization Busy" mask="0x10"/>
          <bitfield name="CLEAR" caption="Clear Synchronization Busy" mask="0x20"/>
        </register>
        <register name="CLEAR" offset="0xC" rw="W" access="WSYNC" size="1" initval="0x00" caption="Clear">
          <bitfield name="CLEAR" caption="Watchdog Clear" mask="0xFF" values="CLEAR__CLEAR"/>
        </register>
      </register-group>
      <value-group name="CONFIG__PER">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
      <value-group name="CONFIG__WINDOW">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
      <value-group name="EWCTRL__EWOFFSET">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
      <value-group name="CLEAR__CLEAR">
        <value name="KEY" caption="Clear Key" value="0xA5"/>
      </value-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="PIC32CZCA176B" caption="PIC32CZCA176B">
      <pin position="A2" pad="PD10"/>
      <pin position="A3" pad="PD09"/>
      <pin position="A4" pad="PD06"/>
      <pin position="A5" pad="PD05"/>
      <pin position="A6" pad="PD19"/>
      <pin position="A7" pad="PD18"/>
      <pin position="A8" pad="PD17"/>
      <pin position="A9" pad="PD14"/>
      <pin position="A10" pad="PD01"/>
      <pin position="A11" pad="PD00"/>
      <pin position="A12" pad="USBID1"/>
      <pin position="A13" pad="USBDM1"/>
      <pin position="A14" pad="VBUS0"/>
      <pin position="A15" pad="USBID0"/>
      <pin position="B1" pad="PA01"/>
      <pin position="B2" pad="PD12"/>
      <pin position="B3" pad="PD11"/>
      <pin position="B4" pad="PD08"/>
      <pin position="B5" pad="PD20"/>
      <pin position="B6" pad="VDDREG"/>
      <pin position="B7" pad="PD04"/>
      <pin position="B8" pad="PD03"/>
      <pin position="B9" pad="PD02"/>
      <pin position="B10" pad="PD23"/>
      <pin position="B11" pad="VSSUSBD"/>
      <pin position="B12" pad="VDDREG"/>
      <pin position="B13" pad="USBDP1"/>
      <pin position="B14" pad="VSSUSBA"/>
      <pin position="B15" pad="USBDP0"/>
      <pin position="B16" pad="USBDM0"/>
      <pin position="C1" pad="PA03"/>
      <pin position="C2" pad="PA02"/>
      <pin position="C15" pad="PC20"/>
      <pin position="C16" pad="PC19"/>
      <pin position="D1" pad="PA04"/>
      <pin position="D2" pad="PA21"/>
      <pin position="D4" pad="PA00"/>
      <pin position="D13" pad="VCCA3P30"/>
      <pin position="D15" pad="PC18"/>
      <pin position="D16" pad="PC17"/>
      <pin position="E1" pad="PA30"/>
      <pin position="E2" pad="PA06"/>
      <pin position="E5" pad="PA05"/>
      <pin position="E6" pad="PD21"/>
      <pin position="E7" pad="PD16"/>
      <pin position="E8" pad="PD13"/>
      <pin position="E9" pad="USBRBIAS1"/>
      <pin position="E10" pad="VBUS1"/>
      <pin position="E11" pad="VCCA3P31"/>
      <pin position="E12" pad="USBRBIAS0"/>
      <pin position="E15" pad="VSSF"/>
      <pin position="E16" pad="VDDF"/>
      <pin position="F1" pad="PA31"/>
      <pin position="F2" pad="PA22"/>
      <pin position="F5" pad="PE01"/>
      <pin position="F6" pad="PD07"/>
      <pin position="F7" pad="PD15"/>
      <pin position="F8" pad="VSS1"/>
      <pin position="F9" pad="VDDIO"/>
      <pin position="F10" pad="VSS2"/>
      <pin position="F11" pad="PC14"/>
      <pin position="F12" pad="PC15"/>
      <pin position="F15" pad="PC29"/>
      <pin position="F16" pad="RESET_N"/>
      <pin position="G1" pad="PA23"/>
      <pin position="G2" pad="PE00"/>
      <pin position="G5" pad="PE03"/>
      <pin position="G6" pad="PE02"/>
      <pin position="G7" pad="VSS3"/>
      <pin position="G8" pad="VDDIO"/>
      <pin position="G9" pad="VSS4"/>
      <pin position="G10" pad="VDDIO"/>
      <pin position="G11" pad="VSS5"/>
      <pin position="G12" pad="PC27"/>
      <pin position="G15" pad="PC12"/>
      <pin position="G16" pad="PC13"/>
      <pin position="H1" pad="PA07"/>
      <pin position="H2" pad="PA08"/>
      <pin position="H5" pad="PB01"/>
      <pin position="H6" pad="VDDIO"/>
      <pin position="H7" pad="VSSUSBANA1"/>
      <pin position="H8" pad="VDDIO"/>
      <pin position="H9" pad="VSSUSBANA0"/>
      <pin position="H10" pad="VDDIO"/>
      <pin position="H11" pad="VSS"/>
      <pin position="H12" pad="PG00"/>
      <pin position="H15" pad="PG03"/>
      <pin position="H16" pad="PC28"/>
      <pin position="J1" pad="PA09"/>
      <pin position="J2" pad="PA10"/>
      <pin position="J5" pad="PB02"/>
      <pin position="J6" pad="PB23"/>
      <pin position="J7" pad="VDDIO"/>
      <pin position="J8" pad="VSS"/>
      <pin position="J9" pad="VDDIO"/>
      <pin position="J10" pad="VSS6"/>
      <pin position="J11" pad="VDDIO"/>
      <pin position="J12" pad="PC26"/>
      <pin position="J15" pad="PC10"/>
      <pin position="J16" pad="PC11"/>
      <pin position="K1" pad="PA24"/>
      <pin position="K2" pad="PA25"/>
      <pin position="K5" pad="PB03"/>
      <pin position="K6" pad="PB22"/>
      <pin position="K7" pad="VDDIO"/>
      <pin position="K8" pad="VSS10"/>
      <pin position="K9" pad="VDDIO"/>
      <pin position="K10" pad="VSS9"/>
      <pin position="K11" pad="VDDIO"/>
      <pin position="K12" pad="PC31"/>
      <pin position="K15" pad="PG01"/>
      <pin position="K16" pad="PG02"/>
      <pin position="L1" pad="PA26"/>
      <pin position="L2" pad="PA27"/>
      <pin position="L5" pad="PB18"/>
      <pin position="L6" pad="PB06"/>
      <pin position="L7" pad="VSS11"/>
      <pin position="L8" pad="VDDIO"/>
      <pin position="L9" pad="VSS"/>
      <pin position="L10" pad="PB31"/>
      <pin position="L11" pad="PB14"/>
      <pin position="L12" pad="PC30"/>
      <pin position="L15" pad="PC24"/>
      <pin position="L16" pad="PC25"/>
      <pin position="M1" pad="PA11"/>
      <pin position="M2" pad="PA12"/>
      <pin position="M5" pad="PB19"/>
      <pin position="M6" pad="PB21"/>
      <pin position="M7" pad="PB07"/>
      <pin position="M8" pad="PB08"/>
      <pin position="M9" pad="PB30"/>
      <pin position="M10" pad="PB24"/>
      <pin position="M11" pad="PB13"/>
      <pin position="M12" pad="PC01"/>
      <pin position="M15" pad="PC23"/>
      <pin position="M16" pad="PC09"/>
      <pin position="N1" pad="PA13"/>
      <pin position="N2" pad="PA14"/>
      <pin position="N4" pad="PB00"/>
      <pin position="N13" pad="PC00"/>
      <pin position="N15" pad="PC22"/>
      <pin position="N16" pad="PC08"/>
      <pin position="P1" pad="PA28"/>
      <pin position="P2" pad="PA29"/>
      <pin position="P15" pad="PC06"/>
      <pin position="P16" pad="PC07"/>
      <pin position="R1" pad="PA15"/>
      <pin position="R2" pad="PA16"/>
      <pin position="R3" pad="PA18"/>
      <pin position="R4" pad="PA20"/>
      <pin position="R5" pad="AVSS"/>
      <pin position="R6" pad="AVDD"/>
      <pin position="R7" pad="PB27"/>
      <pin position="R8" pad="PF05"/>
      <pin position="R9" pad="PB11"/>
      <pin position="R10" pad="VDDREG"/>
      <pin position="R11" pad="PB12"/>
      <pin position="R12" pad="PB15"/>
      <pin position="R13" pad="PB17"/>
      <pin position="R14" pad="PC02"/>
      <pin position="R15" pad="PC05"/>
      <pin position="R16" pad="PC21"/>
      <pin position="T2" pad="PA19"/>
      <pin position="T3" pad="PA17"/>
      <pin position="T4" pad="PB20"/>
      <pin position="T5" pad="PB04"/>
      <pin position="T6" pad="PB05"/>
      <pin position="T7" pad="PB28"/>
      <pin position="T8" pad="PB09"/>
      <pin position="T9" pad="PB10"/>
      <pin position="T10" pad="PB29"/>
      <pin position="T11" pad="PB25"/>
      <pin position="T12" pad="PB26"/>
      <pin position="T13" pad="PB16"/>
      <pin position="T14" pad="PC03"/>
      <pin position="T15" pad="PC04"/>
    </pinout>
    <pinout name="PIC32CZCA176DR" caption="PIC32CZCA176DR">
      <pin position="A1" pad="PA00"/>
      <pin position="A2" pad="PA02"/>
      <pin position="A3" pad="PA04"/>
      <pin position="A4" pad="VDDIO"/>
      <pin position="A5" pad="PA05"/>
      <pin position="A6" pad="PA21"/>
      <pin position="A7" pad="PA31"/>
      <pin position="A8" pad="PA23"/>
      <pin position="A9" pad="PE01"/>
      <pin position="A10" pad="GND"/>
      <pin position="A11" pad="PA07"/>
      <pin position="A12" pad="PA09"/>
      <pin position="A13" pad="PA25"/>
      <pin position="A14" pad="GND"/>
      <pin position="A15" pad="PA10"/>
      <pin position="A16" pad="PA26"/>
      <pin position="A17" pad="PA12"/>
      <pin position="A18" pad="PA14"/>
      <pin position="A19" pad="PA29"/>
      <pin position="A20" pad="GND"/>
      <pin position="A21" pad="VDDIO"/>
      <pin position="A22" pad="PA17"/>
      <pin position="A23" pad="PA19"/>
      <pin position="A24" pad="PA20"/>
      <pin position="A25" pad="PB00"/>
      <pin position="A26" pad="PB02"/>
      <pin position="A27" pad="PB18"/>
      <pin position="A28" pad="PB20"/>
      <pin position="A29" pad="AVDD"/>
      <pin position="A30" pad="PB05"/>
      <pin position="A31" pad="VDDIO"/>
      <pin position="A32" pad="PB21"/>
      <pin position="A33" pad="PB22"/>
      <pin position="A34" pad="PB07"/>
      <pin position="A35" pad="PB27"/>
      <pin position="A36" pad="GND"/>
      <pin position="A37" pad="PF05"/>
      <pin position="A38" pad="PB10"/>
      <pin position="A39" pad="PB11"/>
      <pin position="A40" pad="VDDIO"/>
      <pin position="A41" pad="PB30"/>
      <pin position="A42" pad="PB24"/>
      <pin position="A43" pad="PB26"/>
      <pin position="A44" pad="VDDREG"/>
      <pin position="A45" pad="PB13"/>
      <pin position="A46" pad="PB15"/>
      <pin position="A47" pad="PB16"/>
      <pin position="A48" pad="PB17"/>
      <pin position="A49" pad="PC00"/>
      <pin position="A50" pad="PC02"/>
      <pin position="A51" pad="PC04"/>
      <pin position="A52" pad="VSSF2"/>
      <pin position="A53" pad="PC06"/>
      <pin position="A54" pad="PC21"/>
      <pin position="A55" pad="PC07"/>
      <pin position="A56" pad="PC23"/>
      <pin position="A57" pad="PC09"/>
      <pin position="A58" pad="VDDIO"/>
      <pin position="A59" pad="PC30"/>
      <pin position="A60" pad="PC26"/>
      <pin position="A61" pad="PG01"/>
      <pin position="A62" pad="PC10"/>
      <pin position="A63" pad="VDDIO"/>
      <pin position="A64" pad="PC27"/>
      <pin position="A65" pad="PC28"/>
      <pin position="A66" pad="PC13"/>
      <pin position="A67" pad="PC14"/>
      <pin position="A68" pad="VDDF"/>
      <pin position="A69" pad="RESET_N"/>
      <pin position="A70" pad="PC18"/>
      <pin position="A71" pad="PC19"/>
      <pin position="A72" pad="PC20"/>
      <pin position="A73" pad="USBDM0"/>
      <pin position="A74" pad="USBDP0"/>
      <pin position="A75" pad="USBID0"/>
      <pin position="A76" pad="VBUS0"/>
      <pin position="A77" pad="VDDREG"/>
      <pin position="A78" pad="USBDM1"/>
      <pin position="A79" pad="VCCA3P31"/>
      <pin position="A80" pad="VSSUSBD"/>
      <pin position="A81" pad="USBRBIAS1"/>
      <pin position="A82" pad="PD01"/>
      <pin position="A83" pad="PD23"/>
      <pin position="A84" pad="PD02"/>
      <pin position="A85" pad="GND"/>
      <pin position="A86" pad="PD15"/>
      <pin position="A87" pad="PD17"/>
      <pin position="A88" pad="PD18"/>
      <pin position="A89" pad="PD05"/>
      <pin position="A90" pad="PD20"/>
      <pin position="A91" pad="PD21"/>
      <pin position="A92" pad="VDDREG"/>
      <pin position="A93" pad="VDDIO"/>
      <pin position="A94" pad="PD09"/>
      <pin position="A95" pad="PD11"/>
      <pin position="A96" pad="PD12"/>
      <pin position="B1" pad="PA01"/>
      <pin position="B2" pad="PA03"/>
      <pin position="B3" pad="GND"/>
      <pin position="B4" pad="PA06"/>
      <pin position="B5" pad="PA30"/>
      <pin position="B6" pad="PA22"/>
      <pin position="B7" pad="PE00"/>
      <pin position="B8" pad="PE02"/>
      <pin position="B9" pad="VDDIO"/>
      <pin position="B10" pad="PA08"/>
      <pin position="B11" pad="PA24"/>
      <pin position="B12" pad="PE03"/>
      <pin position="B13" pad="VDDIO"/>
      <pin position="B14" pad="PA11"/>
      <pin position="B15" pad="PA27"/>
      <pin position="B16" pad="PA13"/>
      <pin position="B17" pad="PA28"/>
      <pin position="B18" pad="PA15"/>
      <pin position="B19" pad="PA16"/>
      <pin position="B20" pad="PA18"/>
      <pin position="B21" pad="PB01"/>
      <pin position="B22" pad="PB03"/>
      <pin position="B23" pad="PB19"/>
      <pin position="B24" pad="AVSS"/>
      <pin position="B25" pad="PB04"/>
      <pin position="B26" pad="GND"/>
      <pin position="B27" pad="PB06"/>
      <pin position="B28" pad="PB23"/>
      <pin position="B29" pad="PB08"/>
      <pin position="B30" pad="VDDIO"/>
      <pin position="B31" pad="PB28"/>
      <pin position="B32" pad="PB09"/>
      <pin position="B33" pad="PB29"/>
      <pin position="B34" pad="GND"/>
      <pin position="B35" pad="PB31"/>
      <pin position="B36" pad="PB25"/>
      <pin position="B37" pad="PB12"/>
      <pin position="B38" pad="GND"/>
      <pin position="B39" pad="VDDIO"/>
      <pin position="B40" pad="PB14"/>
      <pin position="B41" pad="PC01"/>
      <pin position="B42" pad="PC03"/>
      <pin position="B43" pad="VDDF"/>
      <pin position="B44" pad="PC05"/>
      <pin position="B45" pad="PC22"/>
      <pin position="B46" pad="PC08"/>
      <pin position="B47" pad="PC24"/>
      <pin position="B48" pad="PC25"/>
      <pin position="B49" pad="GND"/>
      <pin position="B50" pad="PC31"/>
      <pin position="B51" pad="PG00"/>
      <pin position="B52" pad="PG02"/>
      <pin position="B53" pad="PC11"/>
      <pin position="B54" pad="GND"/>
      <pin position="B55" pad="PG03"/>
      <pin position="B56" pad="PC12"/>
      <pin position="B57" pad="PC29"/>
      <pin position="B58" pad="PC15"/>
      <pin position="B59" pad="VSSF1"/>
      <pin position="B60" pad="PC17"/>
      <pin position="B61" pad="VCCA3P30"/>
      <pin position="B62" pad="VSSUSBA"/>
      <pin position="B63" pad="USBRBIAS0"/>
      <pin position="B64" pad="GND"/>
      <pin position="B65" pad="USBDP1"/>
      <pin position="B66" pad="USBID1"/>
      <pin position="B67" pad="VBUS1"/>
      <pin position="B68" pad="PD00"/>
      <pin position="B69" pad="PD13"/>
      <pin position="B70" pad="PD14"/>
      <pin position="B71" pad="PD03"/>
      <pin position="B72" pad="VDDIO"/>
      <pin position="B73" pad="PD16"/>
      <pin position="B74" pad="PD04"/>
      <pin position="B75" pad="PD19"/>
      <pin position="B76" pad="PD06"/>
      <pin position="B77" pad="PD07"/>
      <pin position="B78" pad="GND"/>
      <pin position="B79" pad="PD08"/>
      <pin position="B80" pad="PD10"/>
    </pinout>
    <pinout name="PIC32CZCA176" caption="PIC32CZCA176">
      <pin position="1" pad="PA00"/>
      <pin position="2" pad="PA01"/>
      <pin position="3" pad="PA02"/>
      <pin position="4" pad="PA03"/>
      <pin position="5" pad="PA04"/>
      <pin position="6" pad="GND"/>
      <pin position="7" pad="VDDIO"/>
      <pin position="8" pad="PA05"/>
      <pin position="9" pad="PA06"/>
      <pin position="10" pad="PA21"/>
      <pin position="11" pad="PA30"/>
      <pin position="12" pad="PA31"/>
      <pin position="13" pad="PA22"/>
      <pin position="14" pad="PA23"/>
      <pin position="15" pad="PE00"/>
      <pin position="16" pad="PE01"/>
      <pin position="17" pad="PE02"/>
      <pin position="18" pad="GND"/>
      <pin position="19" pad="VDDIO"/>
      <pin position="20" pad="PA07"/>
      <pin position="21" pad="PA08"/>
      <pin position="22" pad="PA09"/>
      <pin position="23" pad="PA24"/>
      <pin position="24" pad="PA25"/>
      <pin position="25" pad="PE03"/>
      <pin position="26" pad="GND"/>
      <pin position="27" pad="VDDIO"/>
      <pin position="28" pad="PA10"/>
      <pin position="29" pad="PA11"/>
      <pin position="30" pad="PA26"/>
      <pin position="31" pad="PA27"/>
      <pin position="32" pad="PA12"/>
      <pin position="33" pad="PA13"/>
      <pin position="34" pad="PA14"/>
      <pin position="35" pad="PA28"/>
      <pin position="36" pad="PA29"/>
      <pin position="37" pad="PA15"/>
      <pin position="38" pad="GND"/>
      <pin position="39" pad="VDDIO"/>
      <pin position="40" pad="PA16"/>
      <pin position="41" pad="PA17"/>
      <pin position="42" pad="PA18"/>
      <pin position="43" pad="PA19"/>
      <pin position="44" pad="PA20"/>
      <pin position="45" pad="PB00"/>
      <pin position="46" pad="PB01"/>
      <pin position="47" pad="PB02"/>
      <pin position="48" pad="PB03"/>
      <pin position="49" pad="PB18"/>
      <pin position="50" pad="PB19"/>
      <pin position="51" pad="PB20"/>
      <pin position="52" pad="AVSS"/>
      <pin position="53" pad="AVDD"/>
      <pin position="54" pad="PB04"/>
      <pin position="55" pad="PB05"/>
      <pin position="56" pad="VDDIO"/>
      <pin position="57" pad="GND"/>
      <pin position="58" pad="PB21"/>
      <pin position="59" pad="PB06"/>
      <pin position="60" pad="PB22"/>
      <pin position="61" pad="PB23"/>
      <pin position="62" pad="PB07"/>
      <pin position="63" pad="PB08"/>
      <pin position="64" pad="PB27"/>
      <pin position="65" pad="VDDIO"/>
      <pin position="66" pad="GND"/>
      <pin position="67" pad="PB28"/>
      <pin position="68" pad="PF05"/>
      <pin position="69" pad="PB09"/>
      <pin position="70" pad="PB10"/>
      <pin position="71" pad="PB11"/>
      <pin position="72" pad="PB29"/>
      <pin position="73" pad="VDDIO"/>
      <pin position="74" pad="GND"/>
      <pin position="75" pad="PB30"/>
      <pin position="76" pad="PB31"/>
      <pin position="77" pad="PB24"/>
      <pin position="78" pad="PB25"/>
      <pin position="79" pad="PB26"/>
      <pin position="80" pad="PB12"/>
      <pin position="81" pad="VDDREG"/>
      <pin position="82" pad="GND"/>
      <pin position="83" pad="VDDIO"/>
      <pin position="84" pad="PB13"/>
      <pin position="85" pad="PB14"/>
      <pin position="86" pad="PB15"/>
      <pin position="87" pad="PB16"/>
      <pin position="88" pad="PB17"/>
      <pin position="89" pad="PC00"/>
      <pin position="90" pad="PC01"/>
      <pin position="91" pad="PC02"/>
      <pin position="92" pad="PC03"/>
      <pin position="93" pad="PC04"/>
      <pin position="94" pad="VDDF"/>
      <pin position="95" pad="VSSF2"/>
      <pin position="96" pad="PC05"/>
      <pin position="97" pad="PC06"/>
      <pin position="98" pad="PC21"/>
      <pin position="99" pad="PC22"/>
      <pin position="100" pad="PC07"/>
      <pin position="101" pad="PC08"/>
      <pin position="102" pad="PC23"/>
      <pin position="103" pad="PC24"/>
      <pin position="104" pad="PC09"/>
      <pin position="105" pad="PC25"/>
      <pin position="106" pad="VDDIO"/>
      <pin position="107" pad="GND"/>
      <pin position="108" pad="PC30"/>
      <pin position="109" pad="PC31"/>
      <pin position="110" pad="PC26"/>
      <pin position="111" pad="PG00"/>
      <pin position="112" pad="PG01"/>
